# Fictitious Names

### Intro:

На этот раз мы все будем делать ручками

Спасибо [Chris Albon](http://chrisalbon.com/) за все (датасет и материалы). Это все его)

Если вы не особо знакомы с джойнами в пандасе - не страшно, сейчас разберемся, освежите память как работают джойны в SQL [here](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/).


https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html


### Step 1. Все как обычно

In [ ]:
import pandas as pd
import numpy as np

### Step 2. Создайте 3 DataFrame на основе данных ниже и положите в переменные data1, data2, data3

In [52]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': [ '4', '5', '7', '8', '11'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [53]:
data1 = pd.DataFrame(raw_data_1)
data2 = pd.DataFrame(raw_data_2)
data3 = pd.DataFrame(raw_data_3)

In [54]:
data1

  first_name last_name subject_id
0       Alex  Anderson          1
1        Amy  Ackerman          2
2      Allen       Ali          3
3      Alice      Aoni          4
4     Ayoung   Atiches          5

In [55]:
data2

  first_name last_name subject_id
0      Billy    Bonder          4
1      Brian     Black          5
2       Bran   Balwner          7
3      Bryce     Brice          8
4      Betty    Btisan         11

In [56]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 3. Объедините data1 и data2 вдоль строк и сохарните в переменную all_data

hint: concat, add, обратите внимание на параметр ignore_index.

In [64]:
all_data = pd.concat([data1, data2], ignore_index = True)

In [65]:
all_data

  first_name last_name subject_id
0       Alex  Anderson          1
1        Amy  Ackerman          2
2      Allen       Ali          3
3      Alice      Aoni          4
4     Ayoung   Atiches          5
5      Billy    Bonder          4
6      Brian     Black          5
7       Bran   Balwner          7
8      Bryce     Brice          8
9      Betty    Btisan         11

In [66]:
assert all_data.shape == (10, 3)

### Step 4. Объедините data1, data2 вдоль колонок и сохраните в all_data_col

In [67]:
all_data_col = pd.concat([data1, data2], axis = 1)

In [68]:
all_data_col

  first_name last_name subject_id first_name last_name subject_id
0       Alex  Anderson          1      Billy    Bonder          4
1        Amy  Ackerman          2      Brian     Black          5
2      Allen       Ali          3       Bran   Balwner          7
3      Alice      Aoni          4      Bryce     Brice          8
4     Ayoung   Atiches          5      Betty    Btisan         11

In [69]:
assert all_data_col.shape == (5, 6)

### Step 5. Объедините all_data и data3 по полю subject_id и сохраните в all_data_merged

In [76]:
all_data_merged = pd.merge(all_data, data3, on='subject_id')

In [77]:
all_data_merged

  first_name last_name subject_id  test_id
0       Alex  Anderson          1       51
1        Amy  Ackerman          2       15
2      Allen       Ali          3       15
3      Alice      Aoni          4       61
4      Billy    Bonder          4       61
5     Ayoung   Atiches          5       16
6      Brian     Black          5       16
7       Bran   Balwner          7       14
8      Bryce     Brice          8       15
9      Betty    Btisan         11       16

In [78]:
assert all_data_merged.shape==(10, 4)

### Step 6. Объедините data1, data2. Нужно оставить только те записи, где  'subject_id' встречается в обоих DF. Сохраните в переменную AAA

In [121]:
# df1 = data1[data1.subject_id.isin(data2.subject_id)]
# df2 = data2[data2.subject_id.isin(data1.subject_id)]
# AAA = pd.concat([df1, df2], ignore_index = True)
# хммм

AAA = pd.merge(data1, data2, on = 'subject_id')

  first_name_x last_name_x subject_id first_name_y last_name_y
0        Alice        Aoni          4        Billy      Bonder
1       Ayoung     Atiches          5        Brian       Black

In [120]:
assert AAA.shape == (2, 5)

### Step 7. Объедините data1, data2 по 'subject_id', сматчив записи с обоих датафреймов, где это возможно, и оставив информацию с обоих датафреймов где не сматчилось. (на какой вид SQL мерджа это похоже? Найдите такой парамер и используйте во благо). Сохраните датафрейм в переменную BBB

In [90]:
BBB = pd.merge(data1, data2, on = 'subject_id', how = 'outer')

In [91]:
assert BBB.shape == (8, 5)

In [92]:
BBB

  first_name_x last_name_x subject_id first_name_y last_name_y
0         Alex    Anderson          1          NaN         NaN
1          Amy    Ackerman          2          NaN         NaN
2        Allen         Ali          3          NaN         NaN
3        Alice        Aoni          4        Billy      Bonder
4       Ayoung     Atiches          5        Brian       Black
5          NaN         NaN          7         Bran     Balwner
6          NaN         NaN          8        Bryce       Brice
7          NaN         NaN         11        Betty      Btisan

In [ ]:
# Обратите внимание у вас могли появиться у названий колонок суффиксы _x и _y.
# это сделано для того чтобы понимать откуда какая запись пришла. Вы можете задать их любыми.
# (например _df1, _df2)

In [124]:
BBB = BBB.rename(columns={'first_name_x': 'first_name_df1', 'last_name_x': 'last_name_df1', 'first_name_y': 'first_name_df2', 'last_name_y': 'last_name_df2'})
BBB

  first_name_df1 last_name_df1 subject_id first_name_df2 last_name_df2
0           Alex      Anderson          1            NaN           NaN
1            Amy      Ackerman          2            NaN           NaN
2          Allen           Ali          3            NaN           NaN
3          Alice          Aoni          4          Billy        Bonder
4         Ayoung       Atiches          5          Brian         Black
5            NaN           NaN          7           Bran       Balwner
6            NaN           NaN          8          Bryce         Brice
7            NaN           NaN         11          Betty        Btisan